<?php
$lang['required']			= "Элемент %s формы пуст.";
$lang['isset']				= "Элемент %s формы должен иметь значение.";
$lang['valid_email']		= "Элемент %s формы должен содержать корректный адрес электронной почты.";
$lang['valid_emails']		= "Элемент %s формы должен содержать список корректных адресов электронной почты.";
//$lang['valid_url']			= "The %s field must contain a valid URL.";
//$lang['valid_ip']			= "The %s field must contain a valid IP.";
$lang['min_length']			= "Элемент %s формы не может составлять менее %s символов.";
$lang['max_length']			= "Элемент %s формы не может составлять более %s символов.";
$lang['exact_length']		= "Элемент %s формы должен составлять ровно %s символов.";
$lang['alpha']				= "Элемент %s формы должен содержать только алфавитные символы.";
$lang['alpha_numeric']		= "Элемент %s формы должен содержать только алфавитно-числовые символы.";
$lang['alpha_dash']			= "Элемент %s формы должен содержать только алфавитно-числовые символы, символы подчёркивания или дефисы";
$lang['numeric']			= "Элемент %s формы должен содержать только числа.";
$lang['is_numeric']			= "Элемент %s формы должен содержать только числовые значения.";
$lang['integer']			= "Элемент %s формы должен содержать только целые числа.";
$lang['regex_match']		= "Элемент %s формы должен быть в правильном формате.";
$lang['matches']			= "Элемент %s формы не соответствует %s полю.";
$lang['is_unique'] 			= "Элемент %s формы должен содержать уникальное значение.";
$lang['is_natural']			= "Элемент %s формы должен содержать только натуральные числа.";
$lang['is_natural_no_zero']	= "Элемент %s формы должен содержать только натуральные числа больше нуля.";
$lang['decimal']			= "Элемент %s формы должен содержать только десятичние числа.";
$lang['less_than']			= "Элемент %s формы должен содержать число меньше чем %s или является числовым значением.";
$lang['greater_than']		= "Элемент %s формы должен содержать число больше чем %s или является числовым значением.";
$lang['isset_value_chk']	= "Элемент %s должен быть выбран"; 
$lang['check_date']			= "Элемент %s должен иметь правильный формат";
$lang['compare_date']		= "Начальная дата должна быть меньше конечной";


/* End of file form_validation_lang.php */
/* Location: ./application/language/russian/form_validation_lang.php */